import Vue from 'vue';

const COLUMN_NAMES = {
  CASE_COUNT: [['都道府県', '感染者数']],
  CASE_PERF: [['都道府県', '感染率']],
  DEATH_COUNT: [['都道府県', '死者数']],
  DEATH_PERF: [['都道府県', '致死率']],
};

const POPULATION = {
  北海道: 5286000,
  青森: 1263000,
  岩手: 1241000,
  宮城: 2316000,
  秋田: 981000,
  山形: 1090000,
  福島: 1864000,
  茨城: 2877000,
  栃木: 1946000,
  群馬: 1952000,
  埼玉: 7330000,
  千葉: 6255000,
  東京: 13822000,
  神奈川: 9177000,
  新潟: 2246000,
  富山: 1050000,
  石川: 1143000,
  福井: 774000,
  山梨: 817000,
  長野: 2063000,
  岐阜: 1997000,
  静岡: 3659000,
  愛知: 7537000,
  三重: 1791000,
  滋賀: 1412000,
  京都: 2591000,
  大阪: 8813000,
  兵庫: 5484000,
  奈良: 1339000,
  和歌山: 935000,
  鳥取: 560000,
  島根: 680000,
  岡山: 1898000,
  広島: 2817000,
  山口: 1370000,
  徳島: 736000,
  香川: 962000,
  愛媛: 1352000,
  高知: 706000,
  福岡: 5107000,
  佐賀: 819000,
  長崎: 1341000,
  熊本: 1757000,
  大分: 1144000,
  宮崎: 1081000,
  鹿児島: 1614000,
  沖縄: 1448000,
};

// vue
Vue.prototype.$COLUMN_NAME = COLUMN_NAMES;
Vue.prototype.$POPULATION = POPULATION;

// app
export default ({ app }, inject) => {
  app.$COLUMN_NAME = COLUMN_NAMES;
};
